-- MySQL dump 10.13  Distrib 8.0.38, for macos14 (arm64)
--
-- Host: localhost    Database: pj1
-- ------------------------------------------------------
-- Server version	9.0.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `car_models`
--

DROP TABLE IF EXISTS `car_models`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `car_models` (
  `id` int NOT NULL AUTO_INCREMENT,
  `model_name` varchar(255) NOT NULL,
  `brand_id` int NOT NULL,
  PRIMARY KEY (`id`),
  KEY `brand_id` (`brand_id`),
  CONSTRAINT `car_models_ibfk_1` FOREIGN KEY (`brand_id`) REFERENCES `car_brands` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=297 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `car_models`
--

LOCK TABLES `car_models` WRITE;
/*!40000 ALTER TABLE `car_models` DISABLE KEYS */;
INSERT INTO `car_models` VALUES (1,'쏘렌토',1),(2,'카니발',1),(3,'스포티지',1),(4,'셀토스',1),(5,'레이',1),(6,'K5',1),(7,'K8',1),(8,'모닝',1),(9,'K3',1),(10,'니로',1),(11,'EV6',1),(12,'모하비',1),(13,'EV9',1),(14,'EV3',1),(15,'K9',1),(16,'싼타페',2),(17,'그랜저',2),(18,'투싼',2),(19,'쏘나타',2),(20,'아반떼',2),(21,'캐스퍼',2),(22,'팰리세이드',2),(23,'코나',2),(24,'아이오닉 5',2),(25,'아이오닉 6',2),(26,'넥쏘',2),(27,'베뉴',2),(28,'GV80',3),(29,'G80',3),(30,'GV70',3),(31,'G90',3),(32,'G70',3),(33,'GV60',3),(34,'토레스',4),(35,'렉스턴 스포츠',4),(36,'티볼리',4),(37,'렉스턴',4),(38,'코란도',4),(39,'트랙스',5),(40,'트레일블레이저',5),(41,'트래버스',5),(42,'콜로라도',5),(43,'타호',5),(44,'이쿼녹스',5),(45,'스파크',5),(46,'QM6',6),(47,'XM3',6),(48,'아르카나',6),(49,'SM6',6),(50,'마이브',7),(51,'볼트 EUV',5),(52,'볼트 EV',5),(53,'쎄보-C',8),(54,'5시리즈',9),(55,'X3',9),(56,'X5',9),(57,'6시리즈',9),(58,'3시리즈',9),(59,'X4',9),(60,'X7',9),(61,'X6',9),(62,'iX3',9),(63,'7시리즈',9),(64,'i5',9),(65,'X1',9),(66,'4시리즈',9),(67,'i4',9),(68,'2시리즈 액티브 투어러',9),(69,'iX1',9),(70,'1시리즈',9),(71,'8시리즈',9),(72,'Z4',9),(73,'2시리즈',9),(74,'M2',9),(75,'i7',9),(76,'iX',9),(77,'M3',9),(78,'XM',9),(79,'M4',9),(80,'X2',9),(81,'X5 M',9),(82,'X6 M',9),(83,'X3 M',9),(84,'X4 M',9),(85,'모델 Y',10),(86,'모델 3',10),(87,'모델 X',10),(88,'모델 S',10),(89,'E클래스',11),(90,'GLC',11),(91,'GLE',11),(92,'C클래스',11),(93,'EQE',11),(94,'S클래스',11),(95,'CLE',11),(96,'A클래스',11),(97,'G클래스',11),(98,'GLB',11),(99,'EQB',11),(100,'GLS',11),(101,'CLA',11),(102,'EQS',11),(103,'EQA',11),(104,'AMG GT',11),(105,'GLA',11),(106,'마이바흐 S클래스',11),(107,'마이바흐 GLS',11),(108,'SL',11),(109,'CLS',11),(110,'XC60',12),(111,'S90',12),(112,'XC90',12),(113,'XC40',12),(114,'V60',12),(115,'S60',12),(116,'V90',12),(117,'C40',12),(118,'ES',13),(119,'NX',13),(120,'RX',13),(121,'UX',13),(122,'RZ',13),(123,'LS',13),(124,'LC',13),(125,'86',14),(126,'RAV4',14),(127,'캠리',14),(128,'시에나',14),(129,'크라운',14),(130,'프리우스',14),(131,'하이랜더',14),(132,'알파드',14),(133,'수프라',14),(134,'툰드라',14),(135,'타코마',14),(136,'FJ 크루져',14),(137,'Q4 e-트론',15),(138,'A6',15),(139,'e-트론',15),(140,'Q8',15),(141,'Q5',15),(142,'A3',15),(143,'A7',15),(144,'Q3',15),(145,'Q7',15),(146,'A5',15),(147,'Q2',15),(148,'A4',15),(149,'RS3',15),(150,'e-트론 GT',15),(151,'SQ7',15),(152,'S6',15),(153,'RSQ8',15),(154,'RS6',15),(155,'S3',15),(156,'R8',15),(157,'A8',15),(158,'RS e-트론 GT',15),(159,'RS7',15),(160,'S7',15),(161,'ID.4',16),(162,'티구안',16),(163,'제타',16),(164,'골프',16),(165,'아테온',16),(166,'투아렉',16),(167,'911',17),(168,'카이엔',17),(169,'파나메라',17),(170,'타이칸',17),(171,'마칸',17),(172,'박스터',17),(173,'카이맨',17),(174,'미니 컨트리맨',18),(175,'미니 해치',18),(176,'미니 클럽맨',18),(177,'미니 컨버터블',18),(178,'미니 쿠퍼',18),(179,'익스플로러',19),(180,'머스탱',19),(181,'브롱코',19),(182,'레인저',19),(183,'익스페디션',19),(184,'F시리즈',19),(185,'어코드',20),(186,'CR-V',20),(187,'오딧세이',20),(188,'파일럿',20),(189,'랭글러',21),(190,'그랜드 체로키',21),(191,'글래디에이터',21),(192,'레니게이드',21),(193,'노틸러스',22),(194,'에비에이터',22),(195,'코세어',22),(196,'네비게이터',22),(197,'레인지로버',23),(198,'디펜더',23),(199,'레인지로버 스포츠',23),(200,'레인지로버 이보크',23),(201,'레인지로버 벨라',23),(202,'디스커버리 스포츠',23),(203,'디스커버리',23),(204,'208',24),(205,'308',24),(206,'408',24),(207,'508',24),(208,'2008',24),(209,'3008',24),(210,'5008',24),(211,'폴스타 2',25),(212,'에스컬레이드',26),(213,'XT4',26),(214,'XT6',26),(215,'CT5',26),(216,'리릭',26),(217,'시에라',27),(218,'허머',27),(219,'그레칼레',28),(220,'플라잉스퍼',29),(221,'컨티넨탈',29),(222,'벤테이가',29),(223,'우루스',30),(224,'우라칸',30),(225,'812',31),(226,'296 GTB',31),(227,'로마',31),(228,'SF90',31),(229,'컬리넌',32),(230,'고스트',32),(231,'스펙터',32),(232,'팬텀',32),(233,'챌린저',33),(234,'램',33),(235,'차저',33),(236,'콜벳',34),(237,'실버라도',34),(238,'동펑 리치6 EV',35),(239,'A110',36),(240,'MX-5',37),(241,'짐니',38),(242,'포투',39),(243,'750S',40),(244,'S8',15),(245,'르반떼',28),(246,'기블리',28),(247,'콰트로포르테',28),(248,'MC20',28),(249,'M8',9),(250,'LM',13),(251,'Q8 e-트론',15),(252,'SQ5',15),(253,'XT5',26),(254,'시안',30),(255,'488',31),(256,'푸로산게',31),(257,'아투라',40),(258,'GT',40),(259,'그레나디어',41),(260,'500',42),(261,'밴티지',43),(262,'스팅어',1),(263,'말리부',5),(264,'이브이 제타',44),(265,'M5',9),(266,'GL클래스',11),(267,'S4',15),(268,'RS5',15),(269,'S5',15),(270,'야리스',14),(271,'체로키',21),(272,'컴패스',21),(273,'유콘',27),(274,'뮬산',29),(275,'그란투리스모',28),(276,'DS7',45),(277,'DS4',45),(278,'DS3',45),(279,'포르토피노',31),(280,'F8',31),(281,'DBX',43),(282,'F-타입',46),(283,'F-페이스',46),(284,'124 스파이더',42),(285,'포포',39),(286,'엘리스',47),(287,'줄리에타',48),(288,'DB11',43),(289,'EQC',11),(290,'4러너',14),(291,'아틀라스',16),(292,'DBS',43),(293,'765LT',40),(294,'듀랑고',33),(295,'D-맥스',49),(296,'줄리아',48);
/*!40000 ALTER TABLE `car_models` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-09-06 14:59:25
